#25. Виконати відключення всіх розділів жорсткого диску, точки монтування файлових систем яких, зчитуються із файлу, ім’я файлу передано через командний рядок.. Вивести список змонтованих розділів до і після виконання дій. #

#!/bin/bash
clear
echo "Будет выполнено отключение всех рazделов диска точки монтирования файловых систем которые записаны в файле:" $1
echo
echo "СПИСОК СМОНТИРОВАННЫХ УСТРОЙСТВ:"
cat /etc/mtab
echo
echo "СПИСОК рожделов диска КОТОРЫЕ БУДУТ ОТМОНТИРОВАНЫ:" 
declare -i i
a3=
while
	read str
do
	grep $str /etc/mtab > lab.txt
	while 
		read a1 a2 a4
	do
		echo $a1 $a2
		a3=$a3' '$a2;
		i=$i+1  
	done < lab.txt
	
done < $1
rm -f lab.txt
if [ $i != 0 ]
then
	for g in $a3
	do	
		echo "Вы действительно хотите отмонтировать?" $g
		read ch
		if [ $ch == "y" ] 
			then
				umount $g
				if [ $? == 0 ]
				then
					echo "отмонтировано"
				else
					echo "ne отмонтировано"
				fi	
			else
				echo "ne отмонтировано"
			
		fi
		
		
	done
else 
	echo "Что-то пошло не так, я бы на Вашем месте проверил входной файл )"
fi
cat /etc/mtab
echo


